app/controllers/housing_databases_controller.rb

SELECT  "inc_accounts".* FROM "inc_accounts" WHERE "inc_accounts"."id" = ? LIMIT 1  [["id", 1]]
SELECT "housings".* FROM "housings" WHERE "housings"."inc_account_id" = ?  [["inc_account_id", 1]]
---
  def showTables
    @inc_account_id = params[:id]
    @inc_account = IncAccount.find(@inc_account_id)
    if session[@inc_account_id]==nil || session[@inc_account_id]==''
      #広告取得
      advertisings=Advertising.all
      @advertisings=[]
      if advertisings.length>0 then
          (0..1).each{|num|
              @advertisings[num]=advertisings[rand(0..advertisings.length-1)]
          }
      end
      render :template => "search/form"
    end
    @housing = Housing.where(inc_account_id: @inc_account_id)