app/controllers/inc_accounts_controller.rb

  def auth
    @inc_account = IncAccount.find_by(inc_name: params[:inc_name])
    if @inc_account && @inc_account.authenticate(params[:password])
      @housing = Housing.where(inc_account_id: @inc_account.id)
---
SELECT  "inc_accounts".* FROM "inc_accounts" WHERE "inc_accounts"."inc_name" = ? LIMIT 1  [["inc_name", "test_inc"]]
SELECT "housings".* FROM "housings" WHERE "housings"."inc_account_id" = ?  [["inc_account_id", 1]]

  def complete
    @inc_account = IncAccount.new(inc_params)
    if params[:cancel]
      render action: 'new'
    elsif params[:regist]
      @inc_account.avaliable = false
      if @inc_account.save
---
INSERT INTO "inc_accounts" ("inc_name", "password_digest", "mail_address", "phone_num", "account_name", "avaliable", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def avaliable
    inc_name = params[:inc_name]
    @inc_account = IncAccount.find_by(inc_name: inc_name)
    if(@inc_account && @inc_account.avaliable == false && @inc_account.update_attribute(:avaliable, true))
---
SELECT  "inc_accounts".* FROM "inc_accounts" WHERE "inc_accounts"."inc_name" = ? LIMIT 1  [["inc_name", "test_inc"]]
UPDATE "inc_accounts" SET "avaliable" = ?, "updated_at" = ? WHERE "inc_accounts"."id" = ?  [["avaliable", "t"], ["updated_at", "2015-12-09 04:44:22.236290"], ["id", 1]]