app/controllers/search_controller.rb

  def form

    if params[:user_name]!=nil && User.find_by(user_name: params[:user_name])!=nil && User.find_by(user_name: params[:user_name]).avaliable!=false
      @user_name = params[:user_name]
    end

      #広告取得
      advertisings=Advertising.all
---
SELECT  "users".* FROM "users" WHERE "users"."user_name" = ? LIMIT 1  [["user_name", ""]]
SELECT "advertisings".* FROM "advertisings"

      @options=[] #住宅の付随情報
      if session[@user_name]!=nil then user=User.select("id").where("user_name = :user_name",user_name: @user_name)
      else user=nil end
      housings=Housing.all
---
SELECT "housings".* FROM "housings"

      @dis_num=-1 #焦点を当てている物件番号

      #広告取得
      advertisings=Advertising.all
---
SELECT "advertisings".* FROM "advertisings"